---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures.DividedPathUpdateMergedPointKeysStepFailed
source: html/57d866cf-6996-ae58-96a5-a4957acf3ac6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures.DividedPathUpdateMergedPointKeysStepFailed Property

Merging failed.

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedPathUpdateMergedPointKeysStepFailed { get; }
```